text = '''
В целом Python можно описать одним предложением:

Высокоуровневый, интерпретируемый, объектно-ориентированный, императивный, строго типизированный язык общего назначения,
 который имеет динамическую типизацию.
 Языки программирования делятся на высокоуровневые и низкоуровневые. Низкоуровневые языки — языки, 
 близкие к машинному коду или его конструкциям (например, байт-кодам). 
 Классикой таких языков являются C, Assembler, Forth.
Что умеет Python?
Python можно использовать на сервере для создания веб-приложений.
Python можно использовать вместе с программным обеспечением для создания рабочих процессов.
Python может подключаться к системам баз данных. Он также может читать и изменять файлы.
Python можно использовать для обработки больших данных и выполнения сложной математики.
Python можно использовать для быстрого создания прототипов или для разработки программного обеспечения, 
готового к производству.
Почему Python?
Python работает на разных платформах (Windows, Mac, Linux, Raspberry Pi).
Python имеет простой синтаксис, аналогичный английскому языку.
Синтаксис Python позволяет разработчикам писать программы с меньшим количеством строк, 
чем в некоторых других языках программирования.
Python работает в системе интерпретатора, что означает, что код может быть выполнен, как только он будет написан. 
Это означает, что прототипирование может быть очень быстрым.
Python можно рассматривать как процедурный, объектно-ориентированный или функциональный.
Python популярный и имеет хорошо развитую экосистему.
Хорошо знать
Самая последняя основная версия Python - это Python 3. Однако Python 2, хотя и не обновляется ничем, 
кроме обновлений безопасности, по-прежнему довольно популярен.
Можно написать Python в интегрированной среде разработки, такой как Thonny, Pycharm, Netbeans или Eclipse, 
которые особенно полезны при управлении большими коллекциями файлов Python.
Синтаксис Python по сравнению с другими языками программирования
Python был разработан для удобства чтения и имеет некоторое сходство с английским языком с влиянием математики.
Python использует новые строки для завершения команды, в отличие от других языков программирования, 
в которых часто используются точки с запятой или круглые скобки.
Python полагается на отступы с использованием пробелов для определения области видимости; например, объем циклов, 
функций и классов. В других языках программирования для этой цели часто используются фигурные скобки.
Python - это интерпретируемый язык программирования, это означает, что как разработчик вы пишете файлы Python .py 
в текстовом редакторе, а затем помещаете эти файлы в интерпретатор Python для выполнения.
Командная строка Python
Чтобы протестировать небольшой объем кода на Python, иногда проще и быстрее всего не записывать код в файл. 
Это стало возможным, потому что Python можно запускать из командной строки.
Python — красивый, лаконичный и многофункциональный язык. Он применяется в совершенно не сочетающихся между 
собой сферах деятельности, способен в одиночку создавать проекты и не смотреть на возможности конкурентных языков.
Частой проблемой, встречающейся среди разработчиков-любителей является поверхностность в изучении Python. 
Обучающие материалы, которые вы (мы) встречаете в интернете перефразируются сотни раз и скрывают важные, 
полезные черты и особенности языков программирования.
Очень важно восполнять белые пятна в своих знаниях не только в начале своего обучения но и на 
протяжении всей своей карьеры иначе завтра фраза «дай дорогу молодым» станет для вас актуальной, 
и вы окажетесь за бортом.
'''